Ran Plan for dir: `infra` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
~ update in-place
- destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_eks_cluster.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "eks" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "demo-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # data.aws_eks_cluster_auth.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "eks" {
      + id    = (known after apply)
      + name  = "demo-cluster"
      + token = (sensitive value)
    }

  # data.kubernetes_service.atlantis will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "kubernetes_service" "atlantis" {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "atlantis"
          + namespace        = "atlantis"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # aws_iam_role.eks_admin will be updated in-place
~ resource "aws_iam_role" "eks_admin" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "*" -> "arn:aws:iam::743683883645:root"
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "eks-admin"
        name                  = "eks-admin"
        tags                  = {
            "Name" = "eks-admin"
        }
        # (11 unchanged attributes hidden)
    }

  # aws_iam_role.eks_read_only will be updated in-place
~ resource "aws_iam_role" "eks_read_only" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ AWS = "*" -> "arn:aws:iam::743683883645:root"
                        }
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "eks-read-only"
        name                  = "eks-read-only"
        tags                  = {
            "Name" = "eks-read-only"
        }
        # (11 unchanged attributes hidden)
    }

  # helm_release.atlantis will be updated in-place
~ resource "helm_release" "atlantis" {
        id                         = "atlantis"
      ~ metadata                   = [
          - {
              - app_version    = "v0.34.0"
              - chart          = "atlantis"
              - first_deployed = 1748261231
              - last_deployed  = 1748261231
              - name           = "atlantis"
              - namespace      = "atlantis"
              - notes          = <<-EOT
                    1. Get the application URL by running these commands:
                         NOTE: It may take a few minutes for the LoadBalancer IP to be available.
                               You can watch the status of by running 'kubectl get svc -w atlantis'
                      export SERVICE_IP=$(kubectl get svc --namespace atlantis atlantis -o jsonpath='{.status.loadBalancer.ingress[0].ip}')
                      echo http://$SERVICE_IP:80
                    2. Atlantis will not start successfully unless at least one of the following sets of credentials are specified (see values.yaml for detailed usage):
                      - github
                      - githubApp
                      - gitea
                      - gitlab
                      - bitbucket
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - github         = {
                          - secret = "xF72ZMzoAOe9K7m0Qh4UWDrpmTNUo61MMpjdwoKi2hhZLquZvcYc5JZ3RYLcXBHyJ3ne9M94LqqRazFKF14cT9xPrhszPrpF9M2RAz5IE1dffmFQDh2aHTuuISmbL4aN"
                          - token  = "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"
                          - user   = "ed-bogd"
                        }
                      - ingress        = {
                          - enabled = false
                        }
                      - orgAllowlist   = "github.com/ed-bogd/*"
                      - service        = {
                          - annotations = {
                              - "service.beta.kubernetes.io/aws-load-balancer-cross-zone-load-balancing-enabled" = "true"
                              - "service.beta.kubernetes.io/aws-load-balancer-scheme"                            = "internet-facing"
                              - "service.beta.kubernetes.io/aws-load-balancer-type"                              = "classic"
                            }
                          - port        = 80
                          - type        = "LoadBalancer"
                        }
                      - serviceAccount = {
                          - annotations = {
                              - "eks.amazonaws.com/role-arn" = "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
                            }
                          - create      = true
                          - name        = "atlantis"
                        }
                      - volumeClaim    = {
                          - accessModes      = [
                              - "ReadWriteOnce",
                            ]
                          - dataStorage      = "5Gi"
                          - enabled          = true
                          - storageClassName = "gp2"
                        }
                    }
                )
              - version        = "5.17.2"
            },
        ] -> (known after apply)
        name                       = "atlantis"
      ~ values                     = [
          ~ <<-EOT
              - github:
              + github:
              -   user: "ed-bogd"
              +   user: "ed-bogd"
              -   token: "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"
              + 
              -   secret: "xF72ZMzoAOe9K7m0Qh4UWDrpmTNUo61MMpjdwoKi2hhZLquZvcYc5JZ3RYLcXBHyJ3ne9M94LqqRazFKF14cT9xPrhszPrpF9M2RAz5IE1dffmFQDh2aHTuuISmbL4aN"
              + vcsSecretName: atlantis-vcs
              - 
              + 
              - orgAllowlist: github.com/ed-bogd/*
              + orgAllowlist: github.com/ed-bogd/*
              - 
              + 
              - serviceAccount:
              + serviceAccount:
              -   create: true
              +   create: true
              -   name: atlantis
              +   name: atlantis
              -   annotations:
              +   annotations:
              -     eks.amazonaws.com/role-arn: "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
              +     eks.amazonaws.com/role-arn: "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
              - 
              + 
              - service:
              + service:
              -   type: LoadBalancer
              +   type: LoadBalancer
              -   port: 80
              +   port: 80
              -   annotations:
              +   annotations:
              -     service.beta.kubernetes.io/aws-load-balancer-scheme: "internet-facing"
              +     service.beta.kubernetes.io/aws-load-balancer-scheme: "internet-facing"
              -     service.beta.kubernetes.io/aws-load-balancer-cross-zone-load-balancing-enabled: "true"
              +     service.beta.kubernetes.io/aws-load-balancer-cross-zone-load-balancing-enabled: "true"
              -     service.beta.kubernetes.io/aws-load-balancer-type: "classic"
              +     service.beta.kubernetes.io/aws-load-balancer-type: "classic"
              - 
              + 
              - ingress:
              + ingress:
              -   enabled: false
              +   enabled: false
              - 
              + 
              - volumeClaim:
              + volumeClaim:
              -   enabled: true
              +   enabled: true
              -   dataStorage: 5Gi
              +   dataStorage: 5Gi
              -   storageClassName: gp2
              +   storageClassName: gp2
                  accessModes: ["ReadWriteOnce"]
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

  # kubernetes_config_map_v1_data.aws_auth will be destroyed
  # (because kubernetes_config_map_v1_data.aws_auth is not in configuration)
- resource "kubernetes_config_map_v1_data" "aws_auth" {
      - data          = {
          - "mapAccounts" = jsonencode([])
          - "mapRoles"    = <<-EOT
                - "groups":
                  - "view"
                  "rolearn": "arn:aws:iam::743683883645:role/eks-read-only"
                  "username": "eks-read-only"
            EOT
          - "mapUsers"    = <<-EOT
                - "groups":
                  - "system:masters"
                  "userarn": "arn:aws:iam::743683883645:user/eks-admin-user"
                  "username": "eks-admin"
            EOT
        } -> null
      - field_manager = "Terraform" -> null
      - id            = "kube-system/aws-auth" -> null

      - metadata {
          - name      = "aws-auth" -> null
          - namespace = "kube-system" -> null
        }
    }

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.32"
      + most_recent        = true
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.eu-central-1.amazonaws.com/id/F11D638F6D95D729F2B782CB3F98186E"
    }

  # module.eks.aws_eks_access_entry.this["cluster_creator"] must be replaced
-/+ resource "aws_eks_access_entry" "this" {
      ~ access_entry_arn  = "arn:aws:eks:eu-central-1:743683883645:access-entry/demo-cluster/root/743683883645//00cb862e-e1ba-8a28-1fd6-a9180951a07f" -> (known after apply)
      ~ created_at        = "2025-05-26T11:32:41Z" -> (known after apply)
      ~ id                = "demo-cluster:arn:aws:iam::743683883645:root" -> (known after apply)
      ~ kubernetes_groups = [] -> (known after apply)
      ~ modified_at       = "2025-05-26T11:32:41Z" -> (known after apply)
      ~ principal_arn     = "arn:aws:iam::743683883645:root" -> "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role" # forces replacement
        tags              = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
      ~ user_name         = "arn:aws:iam::743683883645:root" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"] must be replaced
-/+ resource "aws_eks_access_policy_association" "this" {
      ~ associated_at = "2025-05-26 11:32:41.759 +0000 UTC" -> (known after apply)
      ~ id            = "demo-cluster#arn:aws:iam::743683883645:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy" -> (known after apply)
      ~ modified_at   = "2025-05-26 11:32:41.759 +0000 UTC" -> (known after apply)
      ~ principal_arn = "arn:aws:iam::743683883645:root" -> "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role" # forces replacement
        # (2 unchanged attributes hidden)

      ~ access_scope {
          - namespaces = [] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be updated in-place
~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.44.0-eksbuild.1" -> (known after apply)
        id                          = "demo-cluster:aws-ebs-csi-driver"
        tags                        = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["coredns"] will be updated in-place
~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.11.4-eksbuild.14" -> (known after apply)
        id                          = "demo-cluster:coredns"
        tags                        = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be updated in-place
~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.32.3-eksbuild.7" -> (known after apply)
        id                          = "demo-cluster:kube-proxy"
        tags                        = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be updated in-place
~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.19.5-eksbuild.3" -> (known after apply)
        id                          = "demo-cluster:vpc-cni"
        tags                        = {
            "Environment" = "dev"
            "Project"     = "atlantis-demo"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_cluster.this[0] will be updated in-place
~ resource "aws_eks_cluster" "this" {
        id                            = "demo-cluster"
        name                          = "demo-cluster"
        tags                          = {
            "Environment"           = "dev"
            "Project"               = "atlantis-demo"
            "terraform-aws-modules" = "eks"
        }
        # (12 unchanged attributes hidden)

      ~ vpc_config {
          ~ public_access_cidrs       = (sensitive value)
            # (6 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::743683883645:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/F11D638F6D95D729F2B782CB3F98186E"
        tags            = {
            "Environment" = "dev"
            "Name"        = "demo-cluster-eks-irsa"
            "Project"     = "atlantis-demo"
        }
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
~ resource "aws_kms_key" "this" {
        id                                 = "6760a3c0-56fa-4aab-8434-79d95c245a00"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::743683883645:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::743683883645:root" -> "arn:aws:iam::743683883645:role/atlantis-demo-atlantis-role"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::743683883645:role/demo-cluster-cluster-20250526112404341100000002"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "Environment"           = "dev"
            "Project"               = "atlantis-demo"
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 2 to add, 10 to change, 3 to destroy.

Changes to Outputs:
~ atlantis_url                = "a4ac116dfc76f4a1c9d68e87f1d2d803-212270417.eu-central-1.elb.amazonaws.com" -> (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-0:4141/lock?id=ed-bogd%252Fdevops-task%252Finfra%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra
  ```
Plan: 2 to add, 10 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```